hardcoreerik/OrcSDR/apps/orcsdr-tab5/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_1=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_HOSTED_HOST_SDIO_TX_Q_SIZE=4
CONFIG_ESP_HOSTED_HOST_SDIO_RX_Q_SIZE=2
# Use ESP-Hosted 3.x's Tab5 board profile: it locks Slot 1 to the on-board C6.
CONFIG_ESP32P4_TAB5_C6_BOARD=y
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH=y
CONFIG_ESP_HOSTED_HOST_RESET_GPIO=15
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_CLK=12
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_CMD=13
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D0=11
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D1=10
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D2=9
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D3=8
# The Tab5 power rail is already enabled by M5.begin(). Probe its C6 before
# asserting reset; ESP-Hosted falls back to reset if enumeration fails.
CONFIG_ESP_HOSTED_HOST_CP_RESET_STRATEGY_ONLY_IF_NECESSARY=y
CONFIG_ESP_HOSTED_HOST_CP_RESET_SETTLE_MS=1500
# Tab5 powers the C6 through M5.begin(); initialize Hosted explicitly after
# that board setup instead of starting background SDIO retries before app_main.
CONFIG_ESP_HOSTED_AUTO_CALL_INIT_BEFORE_APP_MAIN=n
CONFIG_ESP_HOSTED_HOST_FEAT_WIFI=y
CONFIG_ESP_HOSTED_HOST_FEAT_NW_SPLIT=y
CONFIG_ESP_HOSTED_HOST_FEAT_NW_SPLIT_AUTO_INIT=n
CONFIG_ESP_HOSTED_HOST_FEAT_NW_SPLIT_NETIF_APP_EXTERNAL=y
CONFIG_ESP_HOSTED_DFLT_TASK_FROM_SPIRAM=y
CONFIG_USB_HOST_DWC_DMA_CAP_MEMORY_IN_PSRAM=y
# Keep incidental mallocs out of on-chip RAM. DMA-capable internal
# memory is reserved for Hosted SDIO + I2S only; RTL URBs stay in PSRAM.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=8192
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=40960
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# mDNS after STA-up was allocating its task from internal RAM and the
# following Hosted SDIO TX/RX alloc asserted (sendbuf / pkt_rxbuff).
CONFIG_MDNS_TASK_CREATE_FROM_SPIRAM=y
CONFIG_MDNS_MEMORY_ALLOC_SPIRAM=y
# PC USB-JTAG VBUS sag trips the P4 BOD at the default 2.6V. Detector
# reset is off on purpose; the radio keeps running through the sag.
CONFIG_ESP_BROWNOUT_DET=n
